[
  {
    "elementId": "char-elara",
    "schemaId": "character-v1",
    "data": {
      "fullName": "Elara Nightwhisper",
      "age": "127 (appears mid-20s)",
      "gender": "Female",
      "species": "Half-Elf",
      "occupation": "Scholar & Historian",
      "summary": "A brilliant half-elf scholar who studies ancient magical artifacts. She keeps her true age and origins carefully hidden, preferring the solitude of dusty tomes to the company of most people.",
      "notes": "Elara's mother was an elven archivist who fell in love with a human merchant. She inherited her mother's longevity and love of knowledge, but her father's restless curiosity. She has spent the last fifty years searching for the lost Library of Moonveil.",
      "appearance.height": "5'8\"",
      "appearance.weight": "Slender",
      "appearance.eyeColor": "Violet with silver flecks",
      "appearance.hairColor": "Silver-white",
      "appearance.distinguishingFeatures": "Delicately pointed ears, usually hidden beneath her hair. A faded scar on her left palm from a magical accident in her youth. Often has ink stains on her fingers.",
      "appearance.clothing": "Favors practical robes in deep blues and grays, always with numerous pockets for books and writing supplies. Wears reading spectacles that may or may not be magical.",
      "personality.traits": ["Intensely curious", "Secretly compassionate", "Socially awkward", "Perfectionist"],
      "personality.strengths": ["Encyclopedic knowledge", "Fluent in twelve languages", "Patient researcher", "Surprisingly good with a quarterstaff"],
      "personality.weaknesses": ["Difficulty trusting others", "Obsessive about her research", "Neglects her own needs", "Terrible cook"],
      "personality.fears": ["Losing her memories", "Outliving everyone she cares about", "The truth about Moonveil being disappointing"],
      "personality.goals": ["Find the Library of Moonveil", "Publish her complete history of the Arcane Wars", "Make a genuine friend"],
      "personality.motivations": ["Preserving knowledge for future generations", "Understanding her own heritage"],
      "background.birthplace": "A small elven enclave near Thornwood Forest",
      "background.family": "Mother (deceased) - Lirael Nightwhisper, elven archivist. Father (deceased) - Marcus Webb, human merchant. No known siblings.",
      "background.education": "Formally trained at Cloudspire Academy. Self-taught in numerous additional fields. Apprenticed under the legendary historian Aldric the Grey.",
      "background.history": "Born during a time of relative peace, Elara showed an early aptitude for magic and scholarship. After her parents' deaths (her mother to illness, her father to old age), she threw herself into research as a way to cope. She discovered references to the Library of Moonveil fifty years ago and has been searching ever since.",
      "abilities.skills": ["Ancient languages", "Magical theory", "Historical analysis", "Artifact identification", "Calligraphy"],
      "abilities.powers": ["Minor illusion magic", "Enhanced memory", "Magical detection"],
      "abilities.equipment": ["Enchanted spectacles (enhanced reading)", "Bottomless satchel", "Moonstone pendant (family heirloom)"]
    }
  },
  {
    "elementId": "char-theron",
    "schemaId": "character-v1",
    "data": {
      "fullName": "Theron Blackwood",
      "age": "34",
      "gender": "Male",
      "species": "Human",
      "occupation": "Forest Ranger",
      "summary": "A seasoned ranger who serves as guardian of Thornwood Forest. Gruff and solitary, he knows every path and hidden glade in the ancient wood.",
      "notes": "Theron was once a soldier who deserted his post after witnessing atrocities during the Border Wars. He found redemption in protecting the forest and its inhabitants. Very few know his past.",
      "appearance.height": "6'2\"",
      "appearance.weight": "Athletic, muscular",
      "appearance.eyeColor": "Deep green",
      "appearance.hairColor": "Dark brown, shoulder-length",
      "appearance.distinguishingFeatures": "A network of small scars on his forearms from years of forestwork. A distinctive falcon tattoo on his right shoulder from his military days. Weather-beaten features.",
      "appearance.clothing": "Practical forest greens and browns. Wears well-worn leather armor and a hooded cloak that blends with the foliage. Never without his bow.",
      "personality.traits": ["Protective", "Observant", "Gruff exterior, warm heart", "Man of few words"],
      "personality.strengths": ["Expert tracker", "Survival specialist", "Deadly accurate archer", "Calm under pressure"],
      "personality.weaknesses": ["Struggles with authority", "Haunted by past", "Difficulty expressing emotions", "Stubborn"],
      "personality.fears": ["Being forced to fight in another war", "Failing to protect the forest", "His past catching up with him"],
      "personality.goals": ["Protect Thornwood and its secrets", "Find peace with his past", "Train a successor"],
      "personality.motivations": ["Atoning for past sins", "Love of the natural world"],
      "background.birthplace": "Silverhollow",
      "background.family": "Estranged from family. Parents still live in Silverhollow but believe him dead. Has a younger sister, Clara, who runs the family trading post.",
      "background.education": "Military training in the King's Rangers. Self-taught forest lore. Learned herb craft from a forest witch.",
      "background.history": "Born to a merchant family, Theron joined the military seeking adventure. The Border Wars changed him. After witnessing his commander order the burning of a village, he deserted and fled into Thornwood. The forest witch Grandmother Moss took him in and taught him its ways. He's served as its guardian for ten years.",
      "abilities.skills": ["Archery", "Tracking", "Wilderness survival", "Herbalism", "Animal handling"],
      "abilities.powers": ["Uncanny sense for danger", "Can communicate with forest animals (limited)"],
      "abilities.equipment": ["Thornwood bow (enchanted, never breaks)", "Hunting knife", "Healer's kit"]
    }
  },
  {
    "elementId": "char-mira",
    "schemaId": "character-v1",
    "data": {
      "fullName": "Mira Stonehart",
      "age": "28",
      "gender": "Female",
      "species": "Dwarf",
      "occupation": "Blacksmith & Weaponsmith",
      "summary": "A talented dwarf blacksmith who runs the finest forge in Silverhollow. She crafts both mundane tools and magical weapons, though she rarely speaks of her past training.",
      "notes": "Mira left her mountain home under mysterious circumstances. She possesses knowledge of ancient dwarven forging techniques that should have taken centuries to master. The Council of Hammers has placed a bounty on her return.",
      "appearance.height": "4'4\"",
      "appearance.weight": "Stocky, powerful build",
      "appearance.eyeColor": "Amber",
      "appearance.hairColor": "Copper-red, usually braided",
      "appearance.distinguishingFeatures": "Intricate geometric tattoos on her arms denoting master smithing achievements. Burn scars on her hands that she wears proudly. A missing tip of her left ring finger.",
      "appearance.clothing": "Practical smith's attire - leather apron, heavy gloves, sturdy boots. Off-duty, favors comfortable tunics in warm colors. Always wears a gold locket.",
      "personality.traits": ["Hardworking", "Fiercely independent", "Secretly artistic", "Loyal to a fault"],
      "personality.strengths": ["Master craftsman", "Physically strong", "Excellent negotiator", "Keeps her word"],
      "personality.weaknesses": ["Stubborn pride", "Keeps too many secrets", "Difficulty asking for help", "Prone to overworking"],
      "personality.fears": ["Being forced to return home", "Her forge being destroyed", "Someone discovering her secret"],
      "personality.goals": ["Build a weapon that will be remembered for ages", "Find a worthy apprentice", "Make peace with her past"],
      "personality.motivations": ["Proving herself on her own terms", "Protecting her adopted community"],
      "background.birthplace": "Ironhold, in the Stonehart Mountains",
      "background.family": "The Stonehart clan are renowned weaponsmiths. Her father Borin is the current Forge Master. Her mother Hilda manages the clan's business affairs. She has three older brothers who never took her seriously.",
      "background.education": "Trained from childhood in the family forges. Completed her masterwork at age 25, the youngest in clan history. Secretly studied forbidden techniques in ancient texts.",
      "background.history": "Mira discovered that her clan's renowned weapons were being sold to those who would use them for conquest. When she tried to expose this, she was silenced and nearly killed. She fled with knowledge of the ancient techniques and set up shop in Silverhollow, far from dwarven territory.",
      "abilities.skills": ["Master smithing", "Metallurgy", "Gem cutting", "Weapon appraisal", "Basic enchantment"],
      "abilities.powers": ["Can sense flaws in metal", "Fire resistance", "Rune inscription"],
      "abilities.equipment": ["Ancestral hammer (hidden)", "Master's tools", "The gold locket (contains something important)"]
    }
  },
  {
    "elementId": "loc-silverhollow",
    "schemaId": "location-v1",
    "data": {
      "name": "Silverhollow",
      "type": "Town",
      "population": "~3,000",
      "climate": "Temperate",
      "region": "Edge of Thornwood Forest",
      "summary": "A prosperous trade town nestled at the border of Thornwood Forest. Known for quality craftsmanship and as a waypoint for travelers heading into the wilds.",
      "notes": "Silverhollow gets its name from the silver mines that were exhausted centuries ago. Now it thrives on trade, crafts, and its reputation as a safe haven.",
      "appearance": "The town is built in a natural hollow, with buildings of grey stone and dark timber arranged in concentric rings around a central marketplace. Silver-capped weather vanes glint on rooftops. The surrounding palisade is more decorative than defensive these days.",
      "landmarks": ["The Silver Fountain (town center)", "Stonehart Forge", "The Wanderer's Rest inn", "Old Mine Memorial"],
      "atmosphere": "Busy but welcoming. The sound of hammers from the forge district mixes with merchants' calls. Smoke rises from chimneys, and the scent of fresh bread wafts from bakeries. Travelers from many lands pass through, giving it a cosmopolitan feel despite its size.",
      "culture.government": "Town Council (elected)",
      "culture.economy": "Trade hub, craftsmanship (especially metalwork), forest products",
      "culture.customs": ["Festival of Silver Moon (autumn celebration)", "Founding Day market", "Apprentice trials at midsummer"],
      "culture.languages": ["Common", "Trade Cant", "Forest Tongue (some)"],
      "history.founded": "Approximately 400 years ago",
      "history.events": ["The Silver Rush (founding era)", "The Great Fire of 312", "The Thornwood Accord (peace treaty with forest folk)"],
      "history.background": "Founded by miners seeking silver, the town outlasted its mines through adaptability. When the silver ran out, the people turned to trade and crafts. The Thornwood Accord, negotiated 200 years ago, established peaceful relations with the forest's denizens and opened profitable trade routes."
    }
  },
  {
    "elementId": "loc-thornwood",
    "schemaId": "location-v1",
    "data": {
      "name": "Thornwood Forest",
      "type": "Natural Feature",
      "population": "Unknown (various forest folk)",
      "climate": "Temperate, misty",
      "region": "Central wilderness",
      "summary": "An ancient, sprawling forest that predates human memory. Beautiful and dangerous in equal measure, it holds secrets from ages past.",
      "notes": "The forest is semi-sentient. Those who respect it may pass safely; those who don't often disappear. It's said the trees can move when no one is watching.",
      "appearance": "Massive ancient trees with silver-barked trunks and deep green canopy. Mist clings to the forest floor most mornings. Bioluminescent fungi light the paths at night. The deeper you go, the larger and more twisted the trees become.",
      "landmarks": ["The Heart Grove (sacred center)", "Moonwell Spring", "The Grandmother's Cottage", "Stone Circle of the Ancients"],
      "atmosphere": "Otherworldly and watchful. The forest seems to breathe. Sounds are muffled, and time feels different under the canopy. Beautiful but unsettling to outsiders. Those attuned to nature find it peaceful.",
      "culture.government": "The Thornwood Council (dryads, treants, rangers)",
      "culture.economy": "Gift economy among forest folk; controlled trade with outsiders for herbs and rare materials",
      "culture.customs": ["Offerings at the forest edge", "Speaking no ill of the trees", "The Midsummer Gathering"],
      "culture.languages": ["Forest Tongue", "Old Sylvan", "Animal speech"],
      "history.founded": "Primordial - the forest has existed since before recorded history",
      "history.events": ["The Sundering (magical catastrophe, ancient)", "The Thornwood Accord (200 years ago)", "The Night of Walking Trees (70 years ago)"],
      "history.background": "The forest is a remnant of the great primordial woods that once covered the continent. It survived the Sundering through the sacrifice of its most powerful guardians. It's said the Library of Moonveil is hidden somewhere in its depths."
    }
  },
  {
    "elementId": "loc-cloudspire",
    "schemaId": "location-v1",
    "data": {
      "name": "Cloudspire Academy",
      "type": "Building",
      "population": "~500 (students, faculty, staff)",
      "climate": "Magically regulated",
      "region": "Floating above the Starfall Mountains",
      "summary": "The most prestigious magical academy in the realm. Built on a massive floating platform, it literally rises above worldly concerns.",
      "notes": "Admission is by examination only, regardless of wealth or status. Many powerful mages, including Elara Nightwhisper, studied here.",
      "appearance": "A cluster of gleaming white towers connected by crystal bridges, floating serenely above the mountain peaks. The central spire reaches impossibly high, its top often wreathed in clouds. Magic makes the whole structure shimmer slightly.",
      "landmarks": ["The Grand Library", "The Astral Observatory", "The Practical Hall", "The Binding Garden"],
      "atmosphere": "Intellectually charged and slightly ethereal. The air hums with latent magic. Students debate in courtyards while impossible experiments happen in towers. Time works strangely here - some say a year at Cloudspire equals only a month in the outside world.",
      "culture.government": "The Archmage Council (seven master mages)",
      "culture.economy": "Funded by tuition, magical contracts, and ancient endowments",
      "culture.customs": ["The Entrance Trials", "Thesis Defense by magical demonstration", "The Starfall Ball (annual)"],
      "culture.languages": ["High Arcane", "Common", "Most major languages represented"],
      "history.founded": "Approximately 800 years ago",
      "history.events": ["The Lifting (when the academy ascended)", "The Demon Breach of 445", "The Great Reformation (100 years ago)"],
      "history.background": "Founded by the legendary Archmage Aldric the Grey, Cloudspire was originally a mountaintop fortress. When war threatened, Aldric raised the entire complex into the sky to ensure knowledge would survive. It has floated ever since, accessible only by magic or the rare visiting airship."
    }
  }
]
